Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.grafana will be created
+ resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespaceOverride: grafana
                grafana.ini:
                  server:
                    domain: "gently-concise-dogfish.ngrok-free.app"
                    root_url: "%(protocol)s://%(domain)s/grafana"
                    serve_from_sub_path: true
                ingress:
                  enabled: true
                  hosts:
                    - "gently-concise-dogfish.ngrok-free.app"
                  path: "/grafana"
            EOT,
        ]
      + verify                     = false
      + version                    = "6.61.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.helm_release.loki will be created
+ resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                write:
                  persistence:
                    size: 3Gi
                read:
                  persistence:
                    size: 3Gi
                backend:
                  persistence:
                    size: 3Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "5.35.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.helm_release.promtail will be created
+ resource "helm_release" "promtail" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                initContainer:
                  # -- Specifies whether the init container for setting inotify max user instances is to be enabled
                  - name: init
                    # -- Docker registry, image and tag for the init container image
                    image: docker.io/busybox:1.33
                    # -- Docker image pull policy for the init container image
                    imagePullPolicy: IfNotPresent
                    # -- The inotify max user instances to configure
                    command:
                      - sh
                      - -c
                      - sysctl -w fs.inotify.max_user_instances=512
                    securityContext:
                      privileged: true
            EOT,
        ]
      + verify                     = false
      + version                    = "6.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`